app/controllers/checks_controller.rb

  def create
    target_url = params[:target_url]
    session_id = SecureRandom.uuid

    # セッションデータを初期化
    @@check_sessions[session_id] = {
      status: 'running',
      logs: [],
      results: [],
      target_url: target_url,
      cancelled: false
    }

    # バックグラウンドでチェックを実行
    thread = Thread.new do
      begin
        checker = ProtospaceCheckerService.new(target_url, session_id: session_id, sessions_store: @@check_sessions) do |log_entry|
          # ログが追加されるたびにセッションに保存
          if @@check_sessions[session_id]
            # progressタイプのログは最後のprogressログを置き換え
            if log_entry[:type] == :progress
              # 最後のログがprogressなら置き換え、そうでなければ追加
              if @@check_sessions[session_id][:logs].last && @@check_sessions[session_id][:logs].last[:type] == :progress
                @@check_sessions[session_id][:logs][-1] = log_entry
              else
                @@check_sessions[session_id][:logs] << log_entry
---
INSERT INTO "check_sessions" ("target_url", "status", "started_at", "completed_at", "created_at", "updated_at") VALUES ('https://protospace2020.herokuapp.com/', 'running', '2025-10-24 13:06:45.786525', NULL, '2025-10-24 13:06:45.793668', '2025-10-24 13:06:45.793668') RETURNING "id"